index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-18 Fri 14:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tmux Configuration Files</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tmux Configuration Files</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgab2275e">About</a></li>
<li><a href="#org503c4ed">Configuration</a>
<ul>
<li><a href="#org1d93878">General Configurations</a></li>
<li><a href="#org0f3aad1">Key bindings</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgab2275e" class="outline-2">
<h2 id="orgab2275e">About</h2>
<div class="outline-text-2" id="text-orgab2275e">
<p>
This repository is for storing my <i>tmux</i> configuration files. As usual, I'll try to make this configuration as vanilla as possible.
</p>
</div>
</div>

<div id="outline-container-org503c4ed" class="outline-2">
<h2 id="org503c4ed">Configuration</h2>
<div class="outline-text-2" id="text-org503c4ed">
</div>

<div id="outline-container-org1d93878" class="outline-3">
<h3 id="org1d93878">General Configurations</h3>
<div class="outline-text-3" id="text-org1d93878">
</div>
<ul class="org-ul">
<li><a id="org551f55e"></a>Use <i>tmux-256color</i> if possible<br />
<div class="outline-text-4" id="text-org551f55e">
<div class="org-src-container">
<pre class="src src-conf">if <span style="color: #bc8f8f;">'infocmp -x tmux-256color &gt; /dev/null 2&gt;&amp;1'</span> <span style="color: #bc8f8f;">'set -g default-terminal "tmux-256color"'</span>
</pre>
</div>
</div>
</li>
<li><a id="org537e064"></a>Screen keybindings<br />
<div class="outline-text-4" id="text-org537e064">
<div class="org-src-container">
<pre class="src src-conf">unbind C-b
set -g prefix C-a
bind a send-prefix
bind a send-prefix
bind-key C-a last-window
</pre>
</div>
<p>
I'm already too familiar with <i>GNU Screen</i>, so <code>C-a</code> is always my prefix key. To make it more <i>Screen-like</i>, <code>C-a C-a</code> will alternate between two latest windows.
</p>
</div>
</li>
<li><a id="org7f2e76e"></a>xterm-keys<br />
<div class="outline-text-4" id="text-org7f2e76e">
<div class="org-src-container">
<pre class="src src-conf">setw -g xterm-keys on
</pre>
</div>
</div>
</li>
<li><a id="orgbc8090b"></a>Automatic Rename<br />
<div class="outline-text-4" id="text-orgbc8090b">
<p>
Rename the window to reflect the current program.
</p>
<div class="org-src-container">
<pre class="src src-conf">setw -g automatic-rename on
</pre>
</div>
</div>
</li>
<li><a id="org0f2f4ef"></a>Window Renumbering<br />
<div class="outline-text-4" id="text-org0f2f4ef">
<p>
Renumber windows when a window is closed.
</p>
<div class="org-src-container">
<pre class="src src-conf">set -g renumber-windows on
</pre>
</div>
</div>
</li>
<li><a id="org38aaba3"></a>Set the terminal title<br />
<div class="outline-text-4" id="text-org38aaba3">
<div class="org-src-container">
<pre class="src src-conf">set -g set-titles on
</pre>
</div>
</div>
</li>
<li><a id="org3c9822d"></a>Monitor activity<br />
<div class="outline-text-4" id="text-org3c9822d">
<p>
Monitor for activity in the window. Windows with activity are highlighted in the status line.
</p>
<div class="org-src-container">
<pre class="src src-conf">set -g monitor-activity on
</pre>
</div>
</div>
</li>
<li><a id="org9499cb7"></a>Visual activity<br />
<div class="outline-text-4" id="text-org9499cb7">
<p>
If on, display a message instead of sending a bell when activity occurs in a window for which the monitor-activity window option is enabled. If set to both, a bell and a message are produced.
</p>
<div class="org-src-container">
<pre class="src src-conf">set -g visual-activity on
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org0f3aad1" class="outline-3">
<h3 id="org0f3aad1">Key bindings</h3>
<div class="outline-text-3" id="text-org0f3aad1">
</div>
<ul class="org-ul">
<li><a id="org765293e"></a>The default keybindings<br />
<div class="outline-text-4" id="text-org765293e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-b</td>
<td class="org-left">Send the prefix key (C-b) through to the application.</td>
</tr>

<tr>
<td class="org-left">C-o</td>
<td class="org-left">Rotate the panes in the current window forwards.</td>
</tr>

<tr>
<td class="org-left">C-z</td>
<td class="org-left">Suspend the tmux client.</td>
</tr>

<tr>
<td class="org-left">!</td>
<td class="org-left">Break the current pane out of the window.</td>
</tr>

<tr>
<td class="org-left">"</td>
<td class="org-left">Split the current pane into two, top and bottom.</td>
</tr>

<tr>
<td class="org-left">#</td>
<td class="org-left">List all paste buffers.</td>
</tr>

<tr>
<td class="org-left">$</td>
<td class="org-left">Rename the current session.</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">Split the current pane into two, left and right.</td>
</tr>

<tr>
<td class="org-left">&amp;</td>
<td class="org-left">Kill the current window.</td>
</tr>

<tr>
<td class="org-left">'</td>
<td class="org-left">Prompt for a window index to select.</td>
</tr>

<tr>
<td class="org-left">(</td>
<td class="org-left">Switch the attached client to the previous session.</td>
</tr>

<tr>
<td class="org-left">)</td>
<td class="org-left">Switch the attached client to the next session.</td>
</tr>

<tr>
<td class="org-left">,</td>
<td class="org-left">Rename the current window.</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">Delete the most recently copied buffer of text.</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">Prompt for an index to move the current window.</td>
</tr>

<tr>
<td class="org-left">0 to 9</td>
<td class="org-left">Select windows 0 to 9.</td>
</tr>

<tr>
<td class="org-left">:</td>
<td class="org-left">Enter the tmux command prompt.</td>
</tr>

<tr>
<td class="org-left">;</td>
<td class="org-left">Move to the previously active pane.</td>
</tr>

<tr>
<td class="org-left">=</td>
<td class="org-left">Choose which buffer to paste interactively from a list.</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-left">List all key bindings.</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">Choose a client to detach.</td>
</tr>

<tr>
<td class="org-left">L</td>
<td class="org-left">Switch the attached client back to the last session.</td>
</tr>

<tr>
<td class="org-left">[</td>
<td class="org-left">Enter copy mode to copy text or view the history.</td>
</tr>

<tr>
<td class="org-left">]</td>
<td class="org-left">Paste the most recently copied buffer of text.</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-left">Create a new window.</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">Detach the current client.</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">Prompt to search for text in open windows.</td>
</tr>

<tr>
<td class="org-left">i</td>
<td class="org-left">Display some information about the current window.</td>
</tr>

<tr>
<td class="org-left">l</td>
<td class="org-left">Move to the previously selected window.</td>
</tr>

<tr>
<td class="org-left">m</td>
<td class="org-left">Mark the current pane (see select-pane -m).</td>
</tr>

<tr>
<td class="org-left">M</td>
<td class="org-left">Clear the marked pane.</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left">Change to the next window.</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">Select the next pane in the current window.</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">Change to the previous window.</td>
</tr>

<tr>
<td class="org-left">q</td>
<td class="org-left">Briefly display pane indexes.</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">Force redraw of the attached client.</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">Select a new session for the attached client interactively.</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">Show the time.</td>
</tr>

<tr>
<td class="org-left">w</td>
<td class="org-left">Choose the current window interactively.</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">Kill the current pane.</td>
</tr>

<tr>
<td class="org-left">z</td>
<td class="org-left">Toggle zoom state of the current pane.</td>
</tr>

<tr>
<td class="org-left">{</td>
<td class="org-left">Swap the current pane with the previous pane.</td>
</tr>

<tr>
<td class="org-left">}</td>
<td class="org-left">Swap the current pane with the next pane.</td>
</tr>

<tr>
<td class="org-left">~</td>
<td class="org-left">Show previous messages from tmux, if any.</td>
</tr>

<tr>
<td class="org-left">Page Up</td>
<td class="org-left">Enter copy mode and scroll one page up.</td>
</tr>

<tr>
<td class="org-left">Up, Down,Left, Right</td>
<td class="org-left">Change to the pane above, below, to the left, or to the right of the current pane.</td>
</tr>

<tr>
<td class="org-left">M-1 to M-7</td>
<td class="org-left">Arrange panes in one of the seven preset layouts: even-horizontal, even-vertical, main-horizontal, main-horizontal-mirrored, main-vertical, main-vertical-mirrored, or tiled.</td>
</tr>

<tr>
<td class="org-left">Space</td>
<td class="org-left">Arrange the current window in the next preset layout.</td>
</tr>

<tr>
<td class="org-left">M-n</td>
<td class="org-left">Move to the next window with a bell or activity marker.</td>
</tr>

<tr>
<td class="org-left">M-o</td>
<td class="org-left">Rotate the panes in the current window backwards.</td>
</tr>

<tr>
<td class="org-left">M-p</td>
<td class="org-left">Move to the previous window with a bell or activity marker.</td>
</tr>

<tr>
<td class="org-left">C-Up, C-Down, C-Left, C-Right</td>
<td class="org-left">Resize the current pane in steps of one cell.</td>
</tr>

<tr>
<td class="org-left">M-Up, M-Down, M-Left, M-Right</td>
<td class="org-left">Resize the current pane in steps of five cells.</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org750a3a7"></a>Clear both screen and history<br />
<div class="outline-text-4" id="text-org750a3a7">
<div class="org-src-container">
<pre class="src src-conf">bind -n C-l send-keys C-l \; run <span style="color: #bc8f8f;">'sleep 0.2'</span> \; clear-history
</pre>
</div>
</div>
</li>
<li><a id="orge687b84"></a>New Session<br />
<div class="outline-text-4" id="text-orge687b84">
<p>
Create a new session,
</p>
<div class="org-src-container">
<pre class="src src-conf">bind C-c new-session
</pre>
</div>
</div>
</li>
<li><a id="orgc1c6754"></a>Find session<br />
<div class="outline-text-4" id="text-orgc1c6754">
<div class="org-src-container">
<pre class="src src-conf">bind C-f command-prompt -p find-session <span style="color: #bc8f8f;">'switch-client -t %%'</span>
</pre>
</div>
</div>
</li>
<li><a id="org935d32b"></a>Session navigation<br />
<div class="outline-text-4" id="text-org935d32b">
<p>
Move to last session
</p>
<div class="org-src-container">
<pre class="src src-conf">bind BTab switch-client -l
</pre>
</div>
</div>
</li>
<li><a id="org797879a"></a>Split window horizontally<br />
<div class="outline-text-4" id="text-org797879a">
<div class="org-src-container">
<pre class="src src-conf">bind - split-window -v
</pre>
</div>
</div>
</li>
<li><a id="org3791db7"></a>Split window vertically<br />
<div class="outline-text-4" id="text-org3791db7">
<div class="org-src-container">
<pre class="src src-conf">bind _ split-window -h
</pre>
</div>
</div>
</li>
<li><a id="org6492416"></a>Pane Navigation<br />
<div class="outline-text-4" id="text-org6492416">
<p>
Move left.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind -r h select-pane -L
</pre>
</div>
<p>
Move Down.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind -r j select-pane -D
</pre>
</div>
<p>
Move Up.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind -r k select-pane -U
</pre>
</div>
<p>
Move Right.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind -r l select-pane -R
</pre>
</div>
<p>
Swap current pane with the next one.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind &gt; swap-pane -D
</pre>
</div>
<p>
Swap current pane with the previous one.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind &lt; swap-pane -U
</pre>
</div>
</div>
</li>
<li><a id="org9d9e2eb"></a>Pane Resizing<br />
<div class="outline-text-4" id="text-org9d9e2eb">
<div class="org-src-container">
<pre class="src src-conf">bind -r H resize-pane -L 2
bind -r J resize-pane -D 2
bind -r K resize-pane -U 2
bind -r L resize-pane -R 2
</pre>
</div>
</div>
</li>
<li><a id="org8f78187"></a>Window Navigation<br />
<div class="outline-text-4" id="text-org8f78187">
<p>
Select previous window.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind C-p previous-window
</pre>
</div>

<p>
Select previous window.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind p previous-window
</pre>
</div>

<p>
Select next window.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind C-n next-window
bind n next-window
</pre>
</div>

<p>
Move to last active window.
</p>
<div class="org-src-container">
<pre class="src src-conf">bind Tab last-window
</pre>
</div>
</div>
</li>
<li><a id="orgb3c50c7"></a>Mouse<br />
<div class="outline-text-4" id="text-orgb3c50c7">
<div class="org-src-container">
<pre class="src src-conf">set -g mouse on
</pre>
</div>
</div>
</li>
<li><a id="org66daca0"></a>Enter Copy Mode<br />
<div class="outline-text-4" id="text-org66daca0">
<div class="org-src-container">
<pre class="src src-conf">bind Enter copy-mode
</pre>
</div>
</div>
</li>
<li><a id="orge4e3047"></a>Reload config<br />
<div class="outline-text-4" id="text-orge4e3047">
<div class="org-src-container">
<pre class="src src-conf">bind-key C-r source-file ~/.config/tmux/tmux.conf \; display-message <span style="color: #bc8f8f;">"Tmux config reloaded!"</span>
</pre>
</div>
</div>
</li>
<li><a id="orgabcdf7e"></a>Edit config<br />
<div class="outline-text-4" id="text-orgabcdf7e">
<div class="org-src-container">
<pre class="src src-conf">bind e new-window -n <span style="color: #bc8f8f;">"~/.config/tmux/tmux.conf"</span> sh -c <span style="color: #bc8f8f;">'${EDITOR:-vim} ~/.config/tmux/tmux.conf &amp;&amp; tmux source ~/.tmux.conf &amp;&amp; tmux display "~/.config/tmux/tmux.conf sourced"'</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-04-17 Thu 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2025-04-18 Fri 14:13</p>
</div>
</body>
</html>
